AccumulationRegisters/РасходыУменьшающиеНалогПоОтдельнымРежимам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>РасходыУменьшающиеНалогПоОтдельнымРежимам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументРасходаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задолженность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходаЕНВДРаспределяемая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляВыручкиРегистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасхода</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВБухучете</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасходыУменьшающиеНалогПоОтдельнымРежимам/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сумму расходов, уменьшающих налог по ЕНВД.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - головная организация.
//   Период - Дата - период рассчета ЕНВД.
//   РегистрацияВНалоговомОргане - Массив - массив с регистрациями по которым необходимо получить расходы.
//                               - СправочникСсылка.РегистрацияВНалоговомОргане - регистрация по которой необходимо получить расходы.
//
// Возвращаемое значение:
//   Структура - описание см. в НоваяСтруктураРасходовЕНВД()
//
Функция РасходыЕНВДЗаКвартал(Организация, Период, РегистрацияВНалоговомОргане = Неопределено) Экспорт
	
	СтруктураРасходов = НоваяСтруктураРасходовЕНВД();
	
	НачалоПериода = НачалоКвартала(Период);
	КонецПериода  = КонецКвартала(Период);
	
	Если Не УчетнаяПолитика.ПлательщикЕНВДЗаПериод(Организация, НачалоПериода, КонецПериода) Тогда
		Возврат СтруктураРасходов;
	КонецЕсли;
	
	Запрос = Новый Запрос;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасходыУменьшающиеНалогПоОтдельнымРежимамОбороты.СчетУчета,
	|	РасходыУменьшающиеНалогПоОтдельнымРежимамОбороты.СуммаРасходаЕНВДОборот КАК СуммаРасходаЕНВД
	|ИЗ
	|	РегистрНакопления.РасходыУменьшающиеНалогПоОтдельнымРежимам.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И &УсловиеПоРегистрацииВНалоговомОргане) КАК РасходыУменьшающиеНалогПоОтдельнымРежимамОбороты";
		
	
	Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
	
		Если ТипЗнч(РегистрацияВНалоговомОргане) = Тип("Массив") Тогда
			РегистрацииВНалоговыхОрганах = РегистрацияВНалоговомОргане;
		Иначе
			РегистрацииВНалоговыхОрганах = Новый Массив;
			РегистрацииВНалоговыхОрганах.Добавить(РегистрацияВНалоговомОргане);
		КонецЕсли;
	
		Запрос.УстановитьПараметр("РегистрацииВНалоговыхОрганах", РегистрацииВНалоговыхОрганах);
		
		УсловиеПоРегистрацииВНалоговомОргане = "РегистрацияВНалоговомОргане В(&РегистрацииВНалоговыхОрганах)";
		
	Иначе
		
		УсловиеПоРегистрацииВНалоговомОргане = "ИСТИНА";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоРегистрацииВНалоговомОргане", УсловиеПоРегистрацииВНалоговомОргане);

	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураРасходов;
	КонецЕсли;
	
	ТаблицаСчетов = УчетРасходовУменьшающихОтдельныеНалоги.СчетаРасходовУменьшающихНалог();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтрокиТаблицыСчетов = ТаблицаСчетов.НайтиСтроки(Новый Структура("СчетУчета", Выборка.СчетУчета));
		Если СтрокиТаблицыСчетов.Количество() <> 0 Тогда
			ВидРасхода = СтрокиТаблицыСчетов[0].ВидРасходов;
			Если СтруктураРасходов.Свойство(ВидРасхода) Тогда
				СтруктураРасходов[ВидРасхода]= СтруктураРасходов[ВидРасхода] + Выборка.СуммаРасходаЕНВД;
			ИначеЕсли ВидРасхода = "ФиксированныеВзносыИП" Тогда
				СтруктураРасходов.СтраховыеВзносы = СтруктураРасходов.СтраховыеВзносы + Выборка.СуммаРасходаЕНВД;
			КонецЕсли;
		Иначе
			СтруктураРасходов["ДобровольноеСтрахование"]= СтруктураРасходов["ДобровольноеСтрахование"] + Выборка.СуммаРасходаЕНВД;
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат СтруктураРасходов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СчетаРасходовУменьшающихНалог()

	СтруктураСчетов = Новый Структура;
	
	// Страховые взносы в ПФР, ФФОМС, ФСС, ФСС_НС для организаций
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПФР_ОПС);   // 69.02.7
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ФОМС);      // 69.03
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ФСС);       // 69.01
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ); // 69.11
	// Фиксированные взносы ИП
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ФОМС_СтраховойГод); // 69.06.3 - взносы в ФФОМС
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПФР_ОПС_ИП);        // 69.06.5 - взносы в ПФР
	СчетаСтраховыхВзносов = БухгалтерскийУчет.ПолучитьМассивСчетовССубсчетами(МассивСчетов, Ложь,, Ложь);
	
	СтруктураСчетов.Вставить("СтраховыеВзносы", СчетаСтраховыхВзносов);
	
	// Больничные
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоОплатеТруда);   // 70
	СтруктураСчетов.Вставить("Больничные", МассивСчетов);
	
	Возврат СтруктураСчетов;
	
КонецФункции

Функция НоваяСтруктураРасходовЕНВД()
	
	СтруктураРасходов = Новый Структура;
	СтруктураРасходов.Вставить("СтраховыеВзносы", 0);
	СтруктураРасходов.Вставить("Больничные", 0);
	СтруктураРасходов.Вставить("ДобровольноеСтрахование", 0);
	
	Возврат СтруктураРасходов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
